tap "adoptopenjdk/openjdk"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "wix/brew"
# Modern replacement for 'ls'
brew "exa"
# Distributed revision control system
brew "git"
# Mac App Store command-line interface
brew "mas"
# Manage multiple Node.js versions
brew "nvm"
# Watch files and take action when they change
brew "watchman"
# UNIX shell (command interpreter)
brew "zsh"
# Apple simulator utilities
brew "wix/brew/applesimutils"
# AdoptOpenJDK OpenJDK (Java) Development Kit
cask "adoptopenjdk8"
# Android SDK component
cask "android-platform-tools"
# Voice and text chat software
cask "discord"
# Web browser
cask "firefox"
cask "font-fira-code"
# HTTP and GraphQL Client
cask "insomnia"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Cloud storage client
cask "onedrive"
# Desktop app for inspecting React JS and React Native projects
cask "reactotron"
# Tool that provides consistent, highly configurable symbols for apps
cask "sf-symbols"
# Video chat, voice call and instant messaging application
cask "skype"
# Video game digital distribution service
cask "steam"
# Open-source code editor
cask "visual-studio-code"
mas "Xcode", id: 497799835
