tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "wix/brew"
brew "automake"
brew "cmake"
brew "cocoapods"
brew "coreutils"
brew "curl"
brew "exa"
brew "git"
brew "mas"
brew "ninja"
brew "swift-format"
brew "swiftlint"
brew "xcodegen"
brew "zsh"
cask "clion"
cask "discord"
cask "font-fira-code"
cask "insomnia"
cask "iterm2"
cask "keycastr"
cask "onedrive"
cask "sf-symbols"
cask "stats"
cask "visual-studio-code"
mas "WhatsApp", id: 1147396723
mas "Xcode", id: 497799835
